MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH144/mcu.h
extern volatile __OC6CONbits_t OC6CONbits __asm__ ("OC6CON") __attribute__((section("sfrs"), address(0xBF844A00)));
extern volatile uint32_t        OC6CONCLR __attribute__((section("sfrs"),address(0xBF844A04)));
extern volatile uint32_t        OC6CONSET __attribute__((section("sfrs"),address(0xBF844A08)));
extern volatile uint32_t        OC6CONINV __attribute__((section("sfrs"),address(0xBF844A0C)));
#define OC6R OC6R
extern volatile uint32_t   OC6R __attribute__((section("sfrs"), address(0xBF844A10)));
extern volatile uint32_t        OC6RCLR __attribute__((section("sfrs"),address(0xBF844A14)));
extern volatile uint32_t        OC6RSET __attribute__((section("sfrs"),address(0xBF844A18)));
extern volatile uint32_t        OC6RINV __attribute__((section("sfrs"),address(0xBF844A1C)));
#define OC6RS OC6RS
extern volatile uint32_t   OC6RS __attribute__((section("sfrs"), address(0xBF844A20)));
extern volatile uint32_t        OC6RSCLR __attribute__((section("sfrs"),address(0xBF844A24)));
extern volatile uint32_t        OC6RSSET __attribute__((section("sfrs"),address(0xBF844A28)));
extern volatile uint32_t        OC6RSINV __attribute__((section("sfrs"),address(0xBF844A2C)));
#define OC7CON OC7CON
extern volatile uint32_t   OC7CON __attribute__((section("sfrs"), address(0xBF844C00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC7CONbits_t;
extern volatile __OC7CONbits_t OC7CONbits __asm__ ("OC7CON") __attribute__((section("sfrs"), address(0xBF844C00)));
extern volatile uint32_t        OC7CONCLR __attribute__((section("sfrs"),address(0xBF844C04)));
extern volatile uint32_t        OC7CONSET __attribute__((section("sfrs"),address(0xBF844C08)));
extern volatile uint32_t        OC7CONINV __attribute__((section("sfrs"),address(0xBF844C0C)));
#define OC7R OC7R
extern volatile uint32_t   OC7R __attribute__((section("sfrs"), address(0xBF844C10)));
extern volatile uint32_t        OC7RCLR __attribute__((section("sfrs"),address(0xBF844C14)));
extern volatile uint32_t        OC7RSET __attribute__((section("sfrs"),address(0xBF844C18)));
extern volatile uint32_t        OC7RINV __attribute__((section("sfrs"),address(0xBF844C1C)));
#define OC7RS OC7RS
extern volatile uint32_t   OC7RS __attribute__((section("sfrs"), address(0xBF844C20)));
extern volatile uint32_t        OC7RSCLR __attribute__((section("sfrs"),address(0xBF844C24)));
extern volatile uint32_t        OC7RSSET __attribute__((section("sfrs"),address(0xBF844C28)));
extern volatile uint32_t        OC7RSINV __attribute__((section("sfrs"),address(0xBF844C2C)));
#define OC8CON OC8CON
extern volatile uint32_t   OC8CON __attribute__((section("sfrs"), address(0xBF844E00)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC8CONbits_t;
extern volatile __OC8CONbits_t OC8CONbits __asm__ ("OC8CON") __attribute__((section("sfrs"), address(0xBF844E00)));
extern volatile uint32_t        OC8CONCLR __attribute__((section("sfrs"),address(0xBF844E04)));
extern volatile uint32_t        OC8CONSET __attribute__((section("sfrs"),address(0xBF844E08)));
extern volatile uint32_t        OC8CONINV __attribute__((section("sfrs"),address(0xBF844E0C)));
#define OC8R OC8R
extern volatile uint32_t   OC8R __attribute__((section("sfrs"), address(0xBF844E10)));
extern volatile uint32_t        OC8RCLR __attribute__((section("sfrs"),address(0xBF844E14)));
extern volatile uint32_t        OC8RSET __attribute__((section("sfrs"),address(0xBF844E18)));
extern volatile uint32_t        OC8RINV __attribute__((section("sfrs"),address(0xBF844E1C)));
#define OC8RS OC8RS
extern volatile uint32_t   OC8RS __attribute__((section("sfrs"), address(0xBF844E20)));
extern volatile uint32_t        OC8RSCLR __attribute__((section("sfrs"),address(0xBF844E24)));
extern volatile uint32_t        OC8RSSET __attribute__((section("sfrs"),address(0xBF844E28)));
extern volatile uint32_t        OC8RSINV __attribute__((section("sfrs"),address(0xBF844E2C)));
#define OC9CON OC9CON
extern volatile uint32_t   OC9CON __attribute__((section("sfrs"), address(0xBF845000)));
typedef union {
  struct {
    uint32_t OCM:3;
    uint32_t OCTSEL:1;
    uint32_t OCFLT:1;
    uint32_t OC32:1;
    uint32_t :7;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t OCM0:1;
    uint32_t OCM1:1;
    uint32_t OCM2:1;
  };
  struct {
    uint32_t :13;
    uint32_t OCSIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __OC9CONbits_t;
extern volatile __OC9CONbits_t OC9CONbits __asm__ ("OC9CON") __attribute__((section("sfrs"), address(0xBF845000)));
extern volatile uint32_t        OC9CONCLR __attribute__((section("sfrs"),address(0xBF845004)));
extern volatile uint32_t        OC9CONSET __attribute__((section("sfrs"),address(0xBF845008)));
extern volatile uint32_t        OC9CONINV __attribute__((section("sfrs"),address(0xBF84500C)));
#define OC9R OC9R
extern volatile uint32_t   OC9R __attribute__((section("sfrs"), address(0xBF845010)));
extern volatile uint32_t        OC9RCLR __attribute__((section("sfrs"),address(0xBF845014)));
extern volatile uint32_t        OC9RSET __attribute__((section("sfrs"),address(0xBF845018)));
extern volatile uint32_t        OC9RINV __attribute__((section("sfrs"),address(0xBF84501C)));
#define OC9RS OC9RS
extern volatile uint32_t   OC9RS __attribute__((section("sfrs"), address(0xBF845020)));
extern volatile uint32_t        OC9RSCLR __attribute__((section("sfrs"),address(0xBF845024)));
extern volatile uint32_t        OC9RSSET __attribute__((section("sfrs"),address(0xBF845028)));
extern volatile uint32_t        OC9RSINV __attribute__((section("sfrs"),address(0xBF84502C)));
#define AD1CON1 AD1CON1
extern volatile uint32_t   AD1CON1 __attribute__((section("sfrs"), address(0xBF84B000)));
typedef struct {
  uint32_t :11;
  uint32_t FRACT:1;
  uint32_t :1;
  uint32_t ADSIDL:1;
  uint32_t :1;
  uint32_t ADCEN:1;
  uint32_t EIE:3;
  uint32_t :3;
  uint32_t STRGSRC:5;
  uint32_t FILTRDLY:5;
} __AD1CON1bits_t;
