MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH144/mcu.h
extern volatile __AD1DATA39bits_t AD1DATA39bits __asm__ ("AD1DATA39") __attribute__((section("sfrs"), address(0xBF84B154)));
#define AD1DATA40 AD1DATA40
extern volatile uint32_t   AD1DATA40 __attribute__((section("sfrs"), address(0xBF84B158)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA40bits_t;
extern volatile __AD1DATA40bits_t AD1DATA40bits __asm__ ("AD1DATA40") __attribute__((section("sfrs"), address(0xBF84B158)));
#define AD1DATA41 AD1DATA41
extern volatile uint32_t   AD1DATA41 __attribute__((section("sfrs"), address(0xBF84B15C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA41bits_t;
extern volatile __AD1DATA41bits_t AD1DATA41bits __asm__ ("AD1DATA41") __attribute__((section("sfrs"), address(0xBF84B15C)));
#define AD1DATA42 AD1DATA42
extern volatile uint32_t   AD1DATA42 __attribute__((section("sfrs"), address(0xBF84B160)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA42bits_t;
extern volatile __AD1DATA42bits_t AD1DATA42bits __asm__ ("AD1DATA42") __attribute__((section("sfrs"), address(0xBF84B160)));
#define AD1DATA43 AD1DATA43
extern volatile uint32_t   AD1DATA43 __attribute__((section("sfrs"), address(0xBF84B164)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA43bits_t;
extern volatile __AD1DATA43bits_t AD1DATA43bits __asm__ ("AD1DATA43") __attribute__((section("sfrs"), address(0xBF84B164)));
#define AD1DATA44 AD1DATA44
extern volatile uint32_t   AD1DATA44 __attribute__((section("sfrs"), address(0xBF84B168)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA44bits_t;
extern volatile __AD1DATA44bits_t AD1DATA44bits __asm__ ("AD1DATA44") __attribute__((section("sfrs"), address(0xBF84B168)));
#define AD1CAL1 AD1CAL1
extern volatile uint32_t   AD1CAL1 __attribute__((section("sfrs"), address(0xBF84B200)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL1bits_t;
extern volatile __AD1CAL1bits_t AD1CAL1bits __asm__ ("AD1CAL1") __attribute__((section("sfrs"), address(0xBF84B200)));
#define AD1CAL2 AD1CAL2
extern volatile uint32_t   AD1CAL2 __attribute__((section("sfrs"), address(0xBF84B204)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL2bits_t;
extern volatile __AD1CAL2bits_t AD1CAL2bits __asm__ ("AD1CAL2") __attribute__((section("sfrs"), address(0xBF84B204)));
#define AD1CAL3 AD1CAL3
extern volatile uint32_t   AD1CAL3 __attribute__((section("sfrs"), address(0xBF84B208)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL3bits_t;
extern volatile __AD1CAL3bits_t AD1CAL3bits __asm__ ("AD1CAL3") __attribute__((section("sfrs"), address(0xBF84B208)));
#define AD1CAL4 AD1CAL4
extern volatile uint32_t   AD1CAL4 __attribute__((section("sfrs"), address(0xBF84B20C)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL4bits_t;
extern volatile __AD1CAL4bits_t AD1CAL4bits __asm__ ("AD1CAL4") __attribute__((section("sfrs"), address(0xBF84B20C)));
#define AD1CAL5 AD1CAL5
extern volatile uint32_t   AD1CAL5 __attribute__((section("sfrs"), address(0xBF84B210)));
typedef struct {
  uint32_t ADCAL:32;
} __AD1CAL5bits_t;
extern volatile __AD1CAL5bits_t AD1CAL5bits __asm__ ("AD1CAL5") __attribute__((section("sfrs"), address(0xBF84B210)));
#define CM1CON CM1CON
extern volatile uint32_t   CM1CON __attribute__((section("sfrs"), address(0xBF84C000)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM1CONbits_t;
extern volatile __CM1CONbits_t CM1CONbits __asm__ ("CM1CON") __attribute__((section("sfrs"), address(0xBF84C000)));
extern volatile uint32_t        CM1CONCLR __attribute__((section("sfrs"),address(0xBF84C004)));
extern volatile uint32_t        CM1CONSET __attribute__((section("sfrs"),address(0xBF84C008)));
extern volatile uint32_t        CM1CONINV __attribute__((section("sfrs"),address(0xBF84C00C)));
#define CM2CON CM2CON
extern volatile uint32_t   CM2CON __attribute__((section("sfrs"), address(0xBF84C010)));
typedef union {
  struct {
    uint32_t CCH:2;
    uint32_t :2;
    uint32_t CREF:1;
    uint32_t :1;
    uint32_t EVPOL:2;
    uint32_t COUT:1;
    uint32_t :4;
    uint32_t CPOL:1;
    uint32_t COE:1;
    uint32_t ON:1;
  };
  struct {
    uint32_t CCH0:1;
    uint32_t CCH1:1;
    uint32_t :4;
    uint32_t EVPOL0:1;
    uint32_t EVPOL1:1;
  };
  struct {
    uint32_t w:32;
  };
} __CM2CONbits_t;
extern volatile __CM2CONbits_t CM2CONbits __asm__ ("CM2CON") __attribute__((section("sfrs"), address(0xBF84C010)));
extern volatile uint32_t        CM2CONCLR __attribute__((section("sfrs"),address(0xBF84C014)));
extern volatile uint32_t        CM2CONSET __attribute__((section("sfrs"),address(0xBF84C018)));
extern volatile uint32_t        CM2CONINV __attribute__((section("sfrs"),address(0xBF84C01C)));
#define CMSTAT CMSTAT
extern volatile uint32_t   CMSTAT __attribute__((section("sfrs"), address(0xBF84C060)));
typedef union {
  struct {
    uint32_t C1OUT:1;
    uint32_t C2OUT:1;
    uint32_t :11;
    uint32_t SIDL:1;
  };
  struct {
    uint32_t w:32;
  };
} __CMSTATbits_t;
extern volatile __CMSTATbits_t CMSTATbits __asm__ ("CMSTAT") __attribute__((section("sfrs"), address(0xBF84C060)));
extern volatile uint32_t        CMSTATCLR __attribute__((section("sfrs"),address(0xBF84C064)));
extern volatile uint32_t        CMSTATSET __attribute__((section("sfrs"),address(0xBF84C068)));
extern volatile uint32_t        CMSTATINV __attribute__((section("sfrs"),address(0xBF84C06C)));
#define ANSELA ANSELA
extern volatile uint32_t   ANSELA __attribute__((section("sfrs"), address(0xBF860000)));
typedef union {
  struct {
    uint32_t ANSA0:1;
    uint32_t ANSA1:1;
    uint32_t :3;
    uint32_t ANSA5:1;
    uint32_t :3;
    uint32_t ANSA9:1;
    uint32_t ANSA10:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELAbits_t;
extern volatile __ANSELAbits_t ANSELAbits __asm__ ("ANSELA") __attribute__((section("sfrs"), address(0xBF860000)));
extern volatile uint32_t        ANSELACLR __attribute__((section("sfrs"),address(0xBF860004)));
extern volatile uint32_t        ANSELASET __attribute__((section("sfrs"),address(0xBF860008)));
extern volatile uint32_t        ANSELAINV __attribute__((section("sfrs"),address(0xBF86000C)));
#define TRISA TRISA
extern volatile uint32_t   TRISA __attribute__((section("sfrs"), address(0xBF860010)));
typedef union {
  struct {
    uint32_t TRISA0:1;
    uint32_t TRISA1:1;
    uint32_t TRISA2:1;
    uint32_t TRISA3:1;
    uint32_t TRISA4:1;
    uint32_t TRISA5:1;
    uint32_t TRISA6:1;
    uint32_t TRISA7:1;
    uint32_t :1;
    uint32_t TRISA9:1;
    uint32_t TRISA10:1;
    uint32_t :3;
    uint32_t TRISA14:1;
    uint32_t TRISA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISAbits_t;
extern volatile __TRISAbits_t TRISAbits __asm__ ("TRISA") __attribute__((section("sfrs"), address(0xBF860010)));
extern volatile uint32_t        TRISACLR __attribute__((section("sfrs"),address(0xBF860014)));
extern volatile uint32_t        TRISASET __attribute__((section("sfrs"),address(0xBF860018)));
extern volatile uint32_t        TRISAINV __attribute__((section("sfrs"),address(0xBF86001C)));
#define PORTA PORTA
extern volatile uint32_t   PORTA __attribute__((section("sfrs"), address(0xBF860020)));
typedef union {
  struct {
    uint32_t RA0:1;
    uint32_t RA1:1;
    uint32_t RA2:1;
    uint32_t RA3:1;
    uint32_t RA4:1;
    uint32_t RA5:1;
    uint32_t RA6:1;
    uint32_t RA7:1;
    uint32_t :1;
    uint32_t RA9:1;
    uint32_t RA10:1;
    uint32_t :3;
    uint32_t RA14:1;
    uint32_t RA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTAbits_t;
extern volatile __PORTAbits_t PORTAbits __asm__ ("PORTA") __attribute__((section("sfrs"), address(0xBF860020)));
extern volatile uint32_t        PORTACLR __attribute__((section("sfrs"),address(0xBF860024)));
extern volatile uint32_t        PORTASET __attribute__((section("sfrs"),address(0xBF860028)));
extern volatile uint32_t        PORTAINV __attribute__((section("sfrs"),address(0xBF86002C)));
#define LATA LATA
extern volatile uint32_t   LATA __attribute__((section("sfrs"), address(0xBF860030)));
typedef union {
  struct {
    uint32_t LATA0:1;
    uint32_t LATA1:1;
    uint32_t LATA2:1;
    uint32_t LATA3:1;
    uint32_t LATA4:1;
    uint32_t LATA5:1;
    uint32_t LATA6:1;
    uint32_t LATA7:1;
    uint32_t :1;
    uint32_t LATA9:1;
    uint32_t LATA10:1;
    uint32_t :3;
    uint32_t LATA14:1;
    uint32_t LATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATAbits_t;
extern volatile __LATAbits_t LATAbits __asm__ ("LATA") __attribute__((section("sfrs"), address(0xBF860030)));
extern volatile uint32_t        LATACLR __attribute__((section("sfrs"),address(0xBF860034)));
extern volatile uint32_t        LATASET __attribute__((section("sfrs"),address(0xBF860038)));
extern volatile uint32_t        LATAINV __attribute__((section("sfrs"),address(0xBF86003C)));
#define ODCA ODCA
extern volatile uint32_t   ODCA __attribute__((section("sfrs"), address(0xBF860040)));
typedef union {
  struct {
    uint32_t ODCA0:1;
    uint32_t ODCA1:1;
    uint32_t ODCA2:1;
    uint32_t ODCA3:1;
    uint32_t ODCA4:1;
    uint32_t ODCA5:1;
    uint32_t ODCA6:1;
    uint32_t ODCA7:1;
    uint32_t :1;
    uint32_t ODCA9:1;
    uint32_t ODCA10:1;
    uint32_t :3;
    uint32_t ODCA14:1;
    uint32_t ODCA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCAbits_t;
extern volatile __ODCAbits_t ODCAbits __asm__ ("ODCA") __attribute__((section("sfrs"), address(0xBF860040)));
extern volatile uint32_t        ODCACLR __attribute__((section("sfrs"),address(0xBF860044)));
extern volatile uint32_t        ODCASET __attribute__((section("sfrs"),address(0xBF860048)));
extern volatile uint32_t        ODCAINV __attribute__((section("sfrs"),address(0xBF86004C)));
#define CNPUA CNPUA
extern volatile uint32_t   CNPUA __attribute__((section("sfrs"), address(0xBF860050)));
typedef union {
  struct {
    uint32_t CNPUA0:1;
    uint32_t CNPUA1:1;
    uint32_t CNPUA2:1;
    uint32_t CNPUA3:1;
    uint32_t CNPUA4:1;
    uint32_t CNPUA5:1;
    uint32_t CNPUA6:1;
    uint32_t CNPUA7:1;
    uint32_t :1;
    uint32_t CNPUA9:1;
    uint32_t CNPUA10:1;
    uint32_t :3;
    uint32_t CNPUA14:1;
    uint32_t CNPUA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUAbits_t;
extern volatile __CNPUAbits_t CNPUAbits __asm__ ("CNPUA") __attribute__((section("sfrs"), address(0xBF860050)));
extern volatile uint32_t        CNPUACLR __attribute__((section("sfrs"),address(0xBF860054)));
extern volatile uint32_t        CNPUASET __attribute__((section("sfrs"),address(0xBF860058)));
extern volatile uint32_t        CNPUAINV __attribute__((section("sfrs"),address(0xBF86005C)));
#define CNPDA CNPDA
extern volatile uint32_t   CNPDA __attribute__((section("sfrs"), address(0xBF860060)));
typedef union {
  struct {
    uint32_t CNPDA0:1;
    uint32_t CNPDA1:1;
    uint32_t CNPDA2:1;
    uint32_t CNPDA3:1;
    uint32_t CNPDA4:1;
    uint32_t CNPDA5:1;
    uint32_t CNPDA6:1;
    uint32_t CNPDA7:1;
    uint32_t :1;
    uint32_t CNPDA9:1;
    uint32_t CNPDA10:1;
    uint32_t :3;
    uint32_t CNPDA14:1;
    uint32_t CNPDA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDAbits_t;
extern volatile __CNPDAbits_t CNPDAbits __asm__ ("CNPDA") __attribute__((section("sfrs"), address(0xBF860060)));
extern volatile uint32_t        CNPDACLR __attribute__((section("sfrs"),address(0xBF860064)));
extern volatile uint32_t        CNPDASET __attribute__((section("sfrs"),address(0xBF860068)));
extern volatile uint32_t        CNPDAINV __attribute__((section("sfrs"),address(0xBF86006C)));
#define CNCONA CNCONA
extern volatile uint32_t   CNCONA __attribute__((section("sfrs"), address(0xBF860070)));
typedef union {
  struct {
    uint32_t :13;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONAbits_t;
extern volatile __CNCONAbits_t CNCONAbits __asm__ ("CNCONA") __attribute__((section("sfrs"), address(0xBF860070)));
extern volatile uint32_t        CNCONACLR __attribute__((section("sfrs"),address(0xBF860074)));
extern volatile uint32_t        CNCONASET __attribute__((section("sfrs"),address(0xBF860078)));
extern volatile uint32_t        CNCONAINV __attribute__((section("sfrs"),address(0xBF86007C)));
#define CNENA CNENA
extern volatile uint32_t   CNENA __attribute__((section("sfrs"), address(0xBF860080)));
typedef union {
  struct {
    uint32_t CNIEA0:1;
    uint32_t CNIEA1:1;
    uint32_t CNIEA2:1;
    uint32_t CNIEA3:1;
    uint32_t CNIEA4:1;
    uint32_t CNIEA5:1;
    uint32_t CNIEA6:1;
    uint32_t CNIEA7:1;
    uint32_t :1;
    uint32_t CNIEA9:1;
    uint32_t CNIEA10:1;
    uint32_t :3;
    uint32_t CNIEA14:1;
    uint32_t CNIEA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENAbits_t;
extern volatile __CNENAbits_t CNENAbits __asm__ ("CNENA") __attribute__((section("sfrs"), address(0xBF860080)));
extern volatile uint32_t        CNENACLR __attribute__((section("sfrs"),address(0xBF860084)));
extern volatile uint32_t        CNENASET __attribute__((section("sfrs"),address(0xBF860088)));
extern volatile uint32_t        CNENAINV __attribute__((section("sfrs"),address(0xBF86008C)));
#define CNSTATA CNSTATA
extern volatile uint32_t   CNSTATA __attribute__((section("sfrs"), address(0xBF860090)));
typedef union {
  struct {
    uint32_t CNSTATA0:1;
    uint32_t CNSTATA1:1;
    uint32_t CNSTATA2:1;
    uint32_t CNSTATA3:1;
    uint32_t CNSTATA4:1;
    uint32_t CNSTATA5:1;
    uint32_t CNSTATA6:1;
    uint32_t CNSTATA7:1;
    uint32_t :1;
    uint32_t CNSTATA9:1;
    uint32_t CNSTATA10:1;
    uint32_t :3;
    uint32_t CNSTATA14:1;
    uint32_t CNSTATA15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATAbits_t;
extern volatile __CNSTATAbits_t CNSTATAbits __asm__ ("CNSTATA") __attribute__((section("sfrs"), address(0xBF860090)));
extern volatile uint32_t        CNSTATACLR __attribute__((section("sfrs"),address(0xBF860094)));
extern volatile uint32_t        CNSTATASET __attribute__((section("sfrs"),address(0xBF860098)));
extern volatile uint32_t        CNSTATAINV __attribute__((section("sfrs"),address(0xBF86009C)));
#define ANSELB ANSELB
extern volatile uint32_t   ANSELB __attribute__((section("sfrs"), address(0xBF860100)));
typedef union {
  struct {
    uint32_t ANSB0:1;
    uint32_t ANSB1:1;
    uint32_t ANSB2:1;
    uint32_t ANSB3:1;
    uint32_t ANSB4:1;
    uint32_t ANSB5:1;
    uint32_t ANSB6:1;
    uint32_t ANSB7:1;
    uint32_t ANSB8:1;
    uint32_t ANSB9:1;
    uint32_t ANSB10:1;
    uint32_t ANSB11:1;
    uint32_t ANSB12:1;
    uint32_t ANSB13:1;
    uint32_t ANSB14:1;
    uint32_t ANSB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELBbits_t;
extern volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB") __attribute__((section("sfrs"), address(0xBF860100)));
extern volatile uint32_t        ANSELBCLR __attribute__((section("sfrs"),address(0xBF860104)));
extern volatile uint32_t        ANSELBSET __attribute__((section("sfrs"),address(0xBF860108)));
extern volatile uint32_t        ANSELBINV __attribute__((section("sfrs"),address(0xBF86010C)));
#define TRISB TRISB
extern volatile uint32_t   TRISB __attribute__((section("sfrs"), address(0xBF860110)));
typedef union {
  struct {
    uint32_t TRISB0:1;
    uint32_t TRISB1:1;
    uint32_t TRISB2:1;
    uint32_t TRISB3:1;
    uint32_t TRISB4:1;
    uint32_t TRISB5:1;
    uint32_t TRISB6:1;
    uint32_t TRISB7:1;
    uint32_t TRISB8:1;
    uint32_t TRISB9:1;
    uint32_t TRISB10:1;
    uint32_t TRISB11:1;
    uint32_t TRISB12:1;
    uint32_t TRISB13:1;
    uint32_t TRISB14:1;
    uint32_t TRISB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs"), address(0xBF860110)));
extern volatile uint32_t        TRISBCLR __attribute__((section("sfrs"),address(0xBF860114)));
extern volatile uint32_t        TRISBSET __attribute__((section("sfrs"),address(0xBF860118)));
extern volatile uint32_t        TRISBINV __attribute__((section("sfrs"),address(0xBF86011C)));
#define PORTB PORTB
extern volatile uint32_t   PORTB __attribute__((section("sfrs"), address(0xBF860120)));
typedef union {
  struct {
    uint32_t RB0:1;
    uint32_t RB1:1;
    uint32_t RB2:1;
    uint32_t RB3:1;
    uint32_t RB4:1;
    uint32_t RB5:1;
    uint32_t RB6:1;
    uint32_t RB7:1;
    uint32_t RB8:1;
    uint32_t RB9:1;
    uint32_t RB10:1;
    uint32_t RB11:1;
    uint32_t RB12:1;
    uint32_t RB13:1;
    uint32_t RB14:1;
    uint32_t RB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs"), address(0xBF860120)));
extern volatile uint32_t        PORTBCLR __attribute__((section("sfrs"),address(0xBF860124)));
extern volatile uint32_t        PORTBSET __attribute__((section("sfrs"),address(0xBF860128)));
extern volatile uint32_t        PORTBINV __attribute__((section("sfrs"),address(0xBF86012C)));
#define LATB LATB
extern volatile uint32_t   LATB __attribute__((section("sfrs"), address(0xBF860130)));
typedef union {
  struct {
    uint32_t LATB0:1;
    uint32_t LATB1:1;
    uint32_t LATB2:1;
    uint32_t LATB3:1;
    uint32_t LATB4:1;
    uint32_t LATB5:1;
    uint32_t LATB6:1;
    uint32_t LATB7:1;
    uint32_t LATB8:1;
    uint32_t LATB9:1;
    uint32_t LATB10:1;
    uint32_t LATB11:1;
    uint32_t LATB12:1;
    uint32_t LATB13:1;
    uint32_t LATB14:1;
    uint32_t LATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATBbits_t;
