MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH144/mcu.h
extern volatile __CNENDbits_t CNENDbits __asm__ ("CNEND") __attribute__((section("sfrs"), address(0xBF860380)));
extern volatile uint32_t        CNENDCLR __attribute__((section("sfrs"),address(0xBF860384)));
extern volatile uint32_t        CNENDSET __attribute__((section("sfrs"),address(0xBF860388)));
extern volatile uint32_t        CNENDINV __attribute__((section("sfrs"),address(0xBF86038C)));
#define CNSTATD CNSTATD
extern volatile uint32_t   CNSTATD __attribute__((section("sfrs"), address(0xBF860390)));
typedef union {
  struct {
    uint32_t CNSTATD0:1;
    uint32_t CNSTATD1:1;
    uint32_t CNSTATD2:1;
    uint32_t CNSTATD3:1;
    uint32_t CNSTATD4:1;
    uint32_t CNSTATD5:1;
    uint32_t CNSTATD6:1;
    uint32_t CNSTATD7:1;
    uint32_t :1;
    uint32_t CNSTATD9:1;
    uint32_t CNSTATD10:1;
    uint32_t CNSTATD11:1;
    uint32_t CNSTATD12:1;
    uint32_t CNSTATD13:1;
    uint32_t CNSTATD14:1;
    uint32_t CNSTATD15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATDbits_t;
extern volatile __CNSTATDbits_t CNSTATDbits __asm__ ("CNSTATD") __attribute__((section("sfrs"), address(0xBF860390)));
extern volatile uint32_t        CNSTATDCLR __attribute__((section("sfrs"),address(0xBF860394)));
extern volatile uint32_t        CNSTATDSET __attribute__((section("sfrs"),address(0xBF860398)));
extern volatile uint32_t        CNSTATDINV __attribute__((section("sfrs"),address(0xBF86039C)));
#define ANSELE ANSELE
extern volatile uint32_t   ANSELE __attribute__((section("sfrs"), address(0xBF860400)));
typedef union {
  struct {
    uint32_t :4;
    uint32_t ANSE4:1;
    uint32_t ANSE5:1;
    uint32_t ANSE6:1;
    uint32_t ANSE7:1;
    uint32_t ANSE8:1;
    uint32_t ANSE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELEbits_t;
extern volatile __ANSELEbits_t ANSELEbits __asm__ ("ANSELE") __attribute__((section("sfrs"), address(0xBF860400)));
extern volatile uint32_t        ANSELECLR __attribute__((section("sfrs"),address(0xBF860404)));
extern volatile uint32_t        ANSELESET __attribute__((section("sfrs"),address(0xBF860408)));
extern volatile uint32_t        ANSELEINV __attribute__((section("sfrs"),address(0xBF86040C)));
#define TRISE TRISE
extern volatile uint32_t   TRISE __attribute__((section("sfrs"), address(0xBF860410)));
typedef union {
  struct {
    uint32_t TRISE0:1;
    uint32_t TRISE1:1;
    uint32_t TRISE2:1;
    uint32_t TRISE3:1;
    uint32_t TRISE4:1;
    uint32_t TRISE5:1;
    uint32_t TRISE6:1;
    uint32_t TRISE7:1;
    uint32_t TRISE8:1;
    uint32_t TRISE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISEbits_t;
extern volatile __TRISEbits_t TRISEbits __asm__ ("TRISE") __attribute__((section("sfrs"), address(0xBF860410)));
extern volatile uint32_t        TRISECLR __attribute__((section("sfrs"),address(0xBF860414)));
extern volatile uint32_t        TRISESET __attribute__((section("sfrs"),address(0xBF860418)));
extern volatile uint32_t        TRISEINV __attribute__((section("sfrs"),address(0xBF86041C)));
#define PORTE PORTE
extern volatile uint32_t   PORTE __attribute__((section("sfrs"), address(0xBF860420)));
typedef union {
  struct {
    uint32_t RE0:1;
    uint32_t RE1:1;
    uint32_t RE2:1;
    uint32_t RE3:1;
    uint32_t RE4:1;
    uint32_t RE5:1;
    uint32_t RE6:1;
    uint32_t RE7:1;
    uint32_t RE8:1;
    uint32_t RE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTEbits_t;
extern volatile __PORTEbits_t PORTEbits __asm__ ("PORTE") __attribute__((section("sfrs"), address(0xBF860420)));
extern volatile uint32_t        PORTECLR __attribute__((section("sfrs"),address(0xBF860424)));
extern volatile uint32_t        PORTESET __attribute__((section("sfrs"),address(0xBF860428)));
extern volatile uint32_t        PORTEINV __attribute__((section("sfrs"),address(0xBF86042C)));
#define LATE LATE
extern volatile uint32_t   LATE __attribute__((section("sfrs"), address(0xBF860430)));
typedef union {
  struct {
    uint32_t LATE0:1;
    uint32_t LATE1:1;
    uint32_t LATE2:1;
    uint32_t LATE3:1;
    uint32_t LATE4:1;
    uint32_t LATE5:1;
    uint32_t LATE6:1;
    uint32_t LATE7:1;
    uint32_t LATE8:1;
    uint32_t LATE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATEbits_t;
extern volatile __LATEbits_t LATEbits __asm__ ("LATE") __attribute__((section("sfrs"), address(0xBF860430)));
extern volatile uint32_t        LATECLR __attribute__((section("sfrs"),address(0xBF860434)));
extern volatile uint32_t        LATESET __attribute__((section("sfrs"),address(0xBF860438)));
extern volatile uint32_t        LATEINV __attribute__((section("sfrs"),address(0xBF86043C)));
#define ODCE ODCE
extern volatile uint32_t   ODCE __attribute__((section("sfrs"), address(0xBF860440)));
typedef union {
  struct {
    uint32_t ODCE0:1;
    uint32_t ODCE1:1;
    uint32_t ODCE2:1;
    uint32_t ODCE3:1;
    uint32_t ODCE4:1;
    uint32_t ODCE5:1;
    uint32_t ODCE6:1;
    uint32_t ODCE7:1;
    uint32_t ODCE8:1;
    uint32_t ODCE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCEbits_t;
extern volatile __ODCEbits_t ODCEbits __asm__ ("ODCE") __attribute__((section("sfrs"), address(0xBF860440)));
extern volatile uint32_t        ODCECLR __attribute__((section("sfrs"),address(0xBF860444)));
extern volatile uint32_t        ODCESET __attribute__((section("sfrs"),address(0xBF860448)));
extern volatile uint32_t        ODCEINV __attribute__((section("sfrs"),address(0xBF86044C)));
#define CNPUE CNPUE
extern volatile uint32_t   CNPUE __attribute__((section("sfrs"), address(0xBF860450)));
typedef union {
  struct {
    uint32_t CNPUE0:1;
    uint32_t CNPUE1:1;
    uint32_t CNPUE2:1;
    uint32_t CNPUE3:1;
    uint32_t CNPUE4:1;
    uint32_t CNPUE5:1;
    uint32_t CNPUE6:1;
    uint32_t CNPUE7:1;
    uint32_t CNPUE8:1;
    uint32_t CNPUE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUEbits_t;
extern volatile __CNPUEbits_t CNPUEbits __asm__ ("CNPUE") __attribute__((section("sfrs"), address(0xBF860450)));
extern volatile uint32_t        CNPUECLR __attribute__((section("sfrs"),address(0xBF860454)));
extern volatile uint32_t        CNPUESET __attribute__((section("sfrs"),address(0xBF860458)));
extern volatile uint32_t        CNPUEINV __attribute__((section("sfrs"),address(0xBF86045C)));
#define CNPDE CNPDE
extern volatile uint32_t   CNPDE __attribute__((section("sfrs"), address(0xBF860460)));
typedef union {
  struct {
    uint32_t CNPDE0:1;
    uint32_t CNPDE1:1;
    uint32_t CNPDE2:1;
    uint32_t CNPDE3:1;
    uint32_t CNPDE4:1;
    uint32_t CNPDE5:1;
    uint32_t CNPDE6:1;
    uint32_t CNPDE7:1;
    uint32_t CNPDE8:1;
    uint32_t CNPDE9:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDEbits_t;
