MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH144/mcu.h
extern volatile __USBE7RXAbits_t USBE7RXAbits __asm__ ("USBE7RXA") __attribute__((section("sfrs"), address(0xBF8E30BC)));
#define USBE0CSR0 USBE0CSR0
extern volatile uint32_t   USBE0CSR0 __attribute__((section("sfrs"), address(0xBF8E3100)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t :5;
    uint32_t RXRDY:1;
    uint32_t TXRDY:1;
    uint32_t STALLED:1;
    uint32_t SETUP:1;
    uint32_t ERROR:1;
    uint32_t REQPKT:1;
    uint32_t STATUS:1;
    uint32_t NAKTO:1;
    uint32_t FLUSH:1;
    uint32_t DT:1;
    uint32_t DTWE:1;
  };
  struct {
    uint32_t :19;
    uint32_t DATAEND:1;
    uint32_t SETEND:1;
    uint32_t STALL:1;
    uint32_t RXRDYC:1;
    uint32_t SETENDC:1;
  };
} __USBE0CSR0bits_t;
extern volatile __USBE0CSR0bits_t USBE0CSR0bits __asm__ ("USBE0CSR0") __attribute__((section("sfrs"), address(0xBF8E3100)));
#define USBE0CSR2 USBE0CSR2
extern volatile uint32_t   USBE0CSR2 __attribute__((section("sfrs"), address(0xBF8E3108)));
typedef struct {
  uint32_t RXCNT:7;
  uint32_t :15;
  uint32_t SPEED:2;
  uint32_t NAKLIM:4;
} __USBE0CSR2bits_t;
extern volatile __USBE0CSR2bits_t USBE0CSR2bits __asm__ ("USBE0CSR2") __attribute__((section("sfrs"), address(0xBF8E3108)));
#define USBE0CSR3 USBE0CSR3
extern volatile uint32_t   USBE0CSR3 __attribute__((section("sfrs"), address(0xBF8E310C)));
typedef struct {
  uint32_t :24;
  uint32_t UTMIDWID:1;
  uint32_t SOFTCONE:1;
  uint32_t DYNFIFOS:1;
  uint32_t HBTXEN:1;
  uint32_t HBRXEN:1;
  uint32_t BIGEND:1;
  uint32_t MPTXEN:1;
  uint32_t MPRXEN:1;
} __USBE0CSR3bits_t;
extern volatile __USBE0CSR3bits_t USBE0CSR3bits __asm__ ("USBE0CSR3") __attribute__((section("sfrs"), address(0xBF8E310C)));
#define USBE1CSR0 USBE1CSR0
extern volatile uint32_t   USBE1CSR0 __attribute__((section("sfrs"), address(0xBF8E3110)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE1CSR0bits_t;
extern volatile __USBE1CSR0bits_t USBE1CSR0bits __asm__ ("USBE1CSR0") __attribute__((section("sfrs"), address(0xBF8E3110)));
#define USBE1CSR1 USBE1CSR1
extern volatile uint32_t   USBE1CSR1 __attribute__((section("sfrs"), address(0xBF8E3114)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE1CSR1bits_t;
extern volatile __USBE1CSR1bits_t USBE1CSR1bits __asm__ ("USBE1CSR1") __attribute__((section("sfrs"), address(0xBF8E3114)));
#define USBE1CSR2 USBE1CSR2
extern volatile uint32_t   USBE1CSR2 __attribute__((section("sfrs"), address(0xBF8E3118)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBE1CSR2bits_t;
extern volatile __USBE1CSR2bits_t USBE1CSR2bits __asm__ ("USBE1CSR2") __attribute__((section("sfrs"), address(0xBF8E3118)));
#define USBE1CSR3 USBE1CSR3
extern volatile uint32_t   USBE1CSR3 __attribute__((section("sfrs"), address(0xBF8E311C)));
typedef struct {
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t RXINTERV:8;
  uint32_t :8;
  uint32_t TXFIFOSZ:4;
  uint32_t RXFIFOSZ:4;
} __USBE1CSR3bits_t;
extern volatile __USBE1CSR3bits_t USBE1CSR3bits __asm__ ("USBE1CSR3") __attribute__((section("sfrs"), address(0xBF8E311C)));
#define USBE2CSR0 USBE2CSR0
extern volatile uint32_t   USBE2CSR0 __attribute__((section("sfrs"), address(0xBF8E3120)));
typedef union {
  struct {
    uint32_t TXMAXP:11;
    uint32_t MULT:5;
    uint32_t TXPKTRDY:1;
    uint32_t FIFONE:1;
    uint32_t ERROR:1;
    uint32_t FLUSH:1;
    uint32_t SETUPPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t NAKTMOUT:1;
    uint32_t DATATGGL:1;
    uint32_t DTWREN:1;
    uint32_t DMAREQMD:1;
    uint32_t FRCDATTG:1;
    uint32_t DMAREQEN:1;
    uint32_t MODE:1;
    uint32_t :1;
    uint32_t AUTOSET:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE2CSR0bits_t;
extern volatile __USBE2CSR0bits_t USBE2CSR0bits __asm__ ("USBE2CSR0") __attribute__((section("sfrs"), address(0xBF8E3120)));
#define USBE2CSR1 USBE2CSR1
extern volatile uint32_t   USBE2CSR1 __attribute__((section("sfrs"), address(0xBF8E3124)));
typedef union {
  struct {
    uint32_t RXMAXP:11;
    uint32_t MULT:5;
    uint32_t RXPKTRDY:1;
    uint32_t FIFOFULL:1;
    uint32_t ERROR:1;
    uint32_t DERRNAKT:1;
    uint32_t FLUSH:1;
    uint32_t REQPKT:1;
    uint32_t RXSTALL:1;
    uint32_t CLRDT:1;
    uint32_t INCOMPRX:1;
    uint32_t DATATGGL:1;
    uint32_t DATATWEN:1;
    uint32_t DMAREQMD:1;
    uint32_t PIDERR:1;
    uint32_t DMAREQEN:1;
    uint32_t AUTORQ:1;
    uint32_t AUTOCLR:1;
  };
  struct {
    uint32_t :18;
    uint32_t UNDERRUN:1;
    uint32_t :1;
    uint32_t SENDSTALL:1;
    uint32_t SENTSTALL:1;
    uint32_t :1;
    uint32_t INCOMPTX:1;
    uint32_t :6;
    uint32_t ISO:1;
  };
} __USBE2CSR1bits_t;
extern volatile __USBE2CSR1bits_t USBE2CSR1bits __asm__ ("USBE2CSR1") __attribute__((section("sfrs"), address(0xBF8E3124)));
#define USBE2CSR2 USBE2CSR2
extern volatile uint32_t   USBE2CSR2 __attribute__((section("sfrs"), address(0xBF8E3128)));
typedef struct {
  uint32_t RXCNT:14;
  uint32_t :2;
  uint32_t TEP:4;
  uint32_t PROTOCOL:2;
  uint32_t SPEED:2;
  uint32_t TXINTERV:8;
} __USBE2CSR2bits_t;
