MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECH144/mcu.h
#define _CNPDK_CNPDK5_POSITION                   0x00000005
#define _CNPDK_CNPDK5_MASK                       0x00000020
#define _CNPDK_CNPDK5_LENGTH                     0x00000001

#define _CNPDK_CNPDK6_POSITION                   0x00000006
#define _CNPDK_CNPDK6_MASK                       0x00000040
#define _CNPDK_CNPDK6_LENGTH                     0x00000001

#define _CNPDK_CNPDK7_POSITION                   0x00000007
#define _CNPDK_CNPDK7_MASK                       0x00000080
#define _CNPDK_CNPDK7_LENGTH                     0x00000001

#define _CNPDK_w_POSITION                        0x00000000
#define _CNPDK_w_MASK                            0xFFFFFFFF
#define _CNPDK_w_LENGTH                          0x00000020

#define _CNCONK_SIDL_POSITION                    0x0000000D
#define _CNCONK_SIDL_MASK                        0x00002000
#define _CNCONK_SIDL_LENGTH                      0x00000001

#define _CNCONK_ON_POSITION                      0x0000000F
#define _CNCONK_ON_MASK                          0x00008000
#define _CNCONK_ON_LENGTH                        0x00000001

#define _CNCONK_w_POSITION                       0x00000000
#define _CNCONK_w_MASK                           0xFFFFFFFF
#define _CNCONK_w_LENGTH                         0x00000020

#define _CNENK_CNIEK0_POSITION                   0x00000000
#define _CNENK_CNIEK0_MASK                       0x00000001
#define _CNENK_CNIEK0_LENGTH                     0x00000001

#define _CNENK_CNIEK1_POSITION                   0x00000001
#define _CNENK_CNIEK1_MASK                       0x00000002
#define _CNENK_CNIEK1_LENGTH                     0x00000001

#define _CNENK_CNIEK2_POSITION                   0x00000002
#define _CNENK_CNIEK2_MASK                       0x00000004
#define _CNENK_CNIEK2_LENGTH                     0x00000001

#define _CNENK_CNIEK3_POSITION                   0x00000003
#define _CNENK_CNIEK3_MASK                       0x00000008
#define _CNENK_CNIEK3_LENGTH                     0x00000001

#define _CNENK_CNIEK4_POSITION                   0x00000004
#define _CNENK_CNIEK4_MASK                       0x00000010
#define _CNENK_CNIEK4_LENGTH                     0x00000001

#define _CNENK_CNIEK5_POSITION                   0x00000005
#define _CNENK_CNIEK5_MASK                       0x00000020
#define _CNENK_CNIEK5_LENGTH                     0x00000001

#define _CNENK_CNIEK6_POSITION                   0x00000006
#define _CNENK_CNIEK6_MASK                       0x00000040
#define _CNENK_CNIEK6_LENGTH                     0x00000001

#define _CNENK_CNIEK7_POSITION                   0x00000007
#define _CNENK_CNIEK7_MASK                       0x00000080
#define _CNENK_CNIEK7_LENGTH                     0x00000001

#define _CNENK_w_POSITION                        0x00000000
#define _CNENK_w_MASK                            0xFFFFFFFF
#define _CNENK_w_LENGTH                          0x00000020

#define _CNSTATK_CNSTATK0_POSITION               0x00000000
#define _CNSTATK_CNSTATK0_MASK                   0x00000001
#define _CNSTATK_CNSTATK0_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK1_POSITION               0x00000001
#define _CNSTATK_CNSTATK1_MASK                   0x00000002
#define _CNSTATK_CNSTATK1_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK2_POSITION               0x00000002
#define _CNSTATK_CNSTATK2_MASK                   0x00000004
#define _CNSTATK_CNSTATK2_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK3_POSITION               0x00000003
#define _CNSTATK_CNSTATK3_MASK                   0x00000008
#define _CNSTATK_CNSTATK3_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK4_POSITION               0x00000004
#define _CNSTATK_CNSTATK4_MASK                   0x00000010
#define _CNSTATK_CNSTATK4_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK5_POSITION               0x00000005
#define _CNSTATK_CNSTATK5_MASK                   0x00000020
#define _CNSTATK_CNSTATK5_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK6_POSITION               0x00000006
#define _CNSTATK_CNSTATK6_MASK                   0x00000040
#define _CNSTATK_CNSTATK6_LENGTH                 0x00000001

#define _CNSTATK_CNSTATK7_POSITION               0x00000007
#define _CNSTATK_CNSTATK7_MASK                   0x00000080
#define _CNSTATK_CNSTATK7_LENGTH                 0x00000001

#define _CNSTATK_w_POSITION                      0x00000000
#define _CNSTATK_w_MASK                          0xFFFFFFFF
#define _CNSTATK_w_LENGTH                        0x00000020

#define _C1CON_DNCNT_POSITION                    0x00000000
#define _C1CON_DNCNT_MASK                        0x0000001F
#define _C1CON_DNCNT_LENGTH                      0x00000005

#define _C1CON_CANBUSY_POSITION                  0x0000000B
#define _C1CON_CANBUSY_MASK                      0x00000800
#define _C1CON_CANBUSY_LENGTH                    0x00000001

#define _C1CON_SIDL_POSITION                     0x0000000D
#define _C1CON_SIDL_MASK                         0x00002000
#define _C1CON_SIDL_LENGTH                       0x00000001

#define _C1CON_ON_POSITION                       0x0000000F
#define _C1CON_ON_MASK                           0x00008000
#define _C1CON_ON_LENGTH                         0x00000001

#define _C1CON_CANCAP_POSITION                   0x00000014
#define _C1CON_CANCAP_MASK                       0x00100000
#define _C1CON_CANCAP_LENGTH                     0x00000001

#define _C1CON_OPMOD_POSITION                    0x00000015
#define _C1CON_OPMOD_MASK                        0x00E00000
#define _C1CON_OPMOD_LENGTH                      0x00000003

#define _C1CON_REQOP_POSITION                    0x00000018
#define _C1CON_REQOP_MASK                        0x07000000
#define _C1CON_REQOP_LENGTH                      0x00000003

#define _C1CON_ABAT_POSITION                     0x0000001B
#define _C1CON_ABAT_MASK                         0x08000000
#define _C1CON_ABAT_LENGTH                       0x00000001

#define _C1CON_w_POSITION                        0x00000000
#define _C1CON_w_MASK                            0xFFFFFFFF
#define _C1CON_w_LENGTH                          0x00000020

#define _C1CFG_BRP_POSITION                      0x00000000
#define _C1CFG_BRP_MASK                          0x0000003F
#define _C1CFG_BRP_LENGTH                        0x00000006

